This is certainly a bug caused by https://github.com/hashicorp/terraform/issues/10876
It is already fixed in Terraform master and will be available in the 0.12 release.

Here is my test with a build of TF master and the provider 0.12 branch.
```
------------------------------------------------------------
~/test-service-account » cat main.tf                                                                                                                                                         alex@alexs-macbook
resource "kubernetes_service_account" "test" {
  metadata {
    generate_name = "test"
  }
}

data "kubernetes_secret" "test" {
  metadata {
    name      = "${kubernetes_service_account.test.default_secret_name}"
    namespace = "${kubernetes_service_account.test.metadata.0.namespace}"
  }
}

output "token" {
  value = "${data.kubernetes_secret.test.data["token"]}"
}

output "cert" {
  value = "${data.kubernetes_secret.test.data["ca.crt"]}"
}
------------------------------------------------------------
~/test-service-account » terraform-local version                                                                                                                                             alex@alexs-macbook
Terraform v0.12.0-dev
+ provider.kubernetes (unversioned)

------------------------------------------------------------
~/test-service-account » terraform-local apply                                                                                                                                               alex@alexs-macbook

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.kubernetes_secret.test will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "test"  {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.test will be created
  + resource "kubernetes_service_account" "test" {
      + automount_service_account_token = false
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generate_name    = "test"
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kubernetes_service_account.test: Creating...
kubernetes_service_account.test: Creation complete after 0s [id=default/testvbkj7]
data.kubernetes_secret.test: Refreshing state...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

cert = -----BEGIN CERTIFICATE-----
MIIDCzCCAfOgAwIBAgIQIoblzX9f5QnHoDZMpR9gTjANBgkqhkiG9w0BAQsFADAv
MS0wKwYDVQQDEyRjMDRiNDdlNy04NDA3LTQ3YTAtYWExNS1iZTU3OGU2M2VlMDMw
HhcNMTkwMzI1MTI1NzI1WhcNMjQwMzIzMTM1NzI1WjAvMS0wKwYDVQQDEyRjMDRi
NDdlNy04NDA3LTQ3YTAtYWExNS1iZTU3OGU2M2VlMDMwggEiMA0GCSqGSIb3DQEB
AQUAA4IBDwAwggEKAoIBAQC75RK1H4ZkcdXxHK31sTNtoj+7yK3SAJYXz05vTrWl
B20pn+0NCvH+qj0DJ3RKM3KcZWSRBGRkSWrnKG8bzF2rHneDOt9jtDDBLZL1I/VT
nMwQ0+egeBMXPIKAgnAMlCDb8dy16PVj/5FTs6NQXvTMjZY5MeDONm5M6Scbfg/O
wO70zdZSVSHIL2Hrv/MKuzLFW6QlwXBq3eD1H1qdi3ZsnydaGs03XE4E3QwrN34M
UzgWzs4/NzXObtURJVUGWFpO84LFWmnblh6UaxMf4WWz9s+1YAd/yC4Z2vWZ/N23
7MRsRsODQQif6wtoq9aJgaDGtLoyqYn8y2nxDjMNZuRpAgMBAAGjIzAhMA4GA1Ud
DwEB/wQEAwICBDAPBgNVHRMBAf8EBTADAQH/MA0GCSqGSIb3DQEBCwUAA4IBAQBe
Mgdv/ckG+/RUqqXo6tvBq1CG4par2wFNDAcOsWBvfLa4XtaPwMXXoF3mqCnRcTia
tXHprF2+/65XAs4UNPwBotjCn/reMoeMzZt3fBxjbtWbidyztz9Cno5iRnYUuNK7
juK41v+eIsafcVbZLyLsu4btVaCpFr2oWWXRa6av0jQbx4Jaj28BdfV7Dsf1jxSS
dCw8jk+YySCo/ezy7NdyfC32X1MHWcvvzTZp2Ui1EKtIOsXRn6F46a5U8nb/PY3T
QBKMV8iboo9u7gY2482734euI/sBr/gzISN4ZihZ5U9qT0AgwxuW5NZWnO/Jb+cA
ml9oN6nE06gMKI6ZDaUn
-----END CERTIFICATE-----

token = eyJhbGciOiJSUzI1NiIsImtpZCI6IiJ9.eyJpc3MiOiJrdWJlcm5ldGVzL3NlcnZpY2VhY2NvdW50Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9uYW1lc3BhY2UiOiJkZWZhdWx0Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9zZWNyZXQubmFtZSI6InRlc3R2YmtqNy10b2tlbi1nZGh2ayIsImt1YmVybmV0ZXMuaW8vc2VydmljZWFjY291bnQvc2VydmljZS1hY2NvdW50Lm5hbWUiOiJ0ZXN0dmJrajciLCJrdWJlcm5ldGVzLmlvL3NlcnZpY2VhY2NvdW50L3NlcnZpY2UtYWNjb3VudC51aWQiOiIyOGEzYTRmMi00ZjU4LTExZTktYThkYy00MjAxMGE4NDAxZGMiLCJzdWIiOiJzeXN0ZW06c2VydmljZWFjY291bnQ6ZGVmYXVsdDp0ZXN0dmJrajcifQ.TeCbBD_BCdfYerE5m_m_2WrCzi6kzmPMnXLL2YsAXFfZYjTcT-sY4m7ZhgMHVpcMEoSlkfVPBpfsTwFlLr0opLMrPIh7YetwcwUIRFlilIVJLrYYRMlFclzhJR4kQyIIa-agZIBf87MhpMfyyj8xZeeINlaugw85lzMureF2YIwCq_NeyBuce0qLnFgSU6pSJ6ZvYhYAJf35vf9M2ipanYv03vumSSv99JJ1WyHQRa4BRhdpg4LVqh0fNvN1W9kKVvkT2pvD8-Y0tSWK-Hr5vCpK8XTP6OKSowl0ceZxXAzDAtGoMbaYiXmTB-JFAeNije3wt8dEUi9oNWhYpqjYcg
------------------------------------------------------------
```